In [1]:
import pandas as pd

In [2]:
demo = pd.read_csv('df_final_demo.txt')
demo

,client_id,clnt_tenure_yr,clnt_tenure_mnth,clnt_age,gendr,num_accts,bal,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [3]:
demo_duplicates = demo.duplicated()
demo_duplicates.sum()

0

In [4]:
print(demo.isnull().sum())

client_id            0
clnt_tenure_yr      14
clnt_tenure_mnth    14
clnt_age            15
gendr               14
num_accts           14
bal                 14
calls_6_mnth        14
logons_6_mnth       14
dtype: int64

In [5]:
print(demo.columns)

Index(['client_id', 'clnt_tenure_yr', 'clnt_tenure_mnth', 'clnt_age', 'gendr',
       'num_accts', 'bal', 'calls_6_mnth', 'logons_6_mnth'],
      dtype='object')

In [6]:
demo = demo.rename(columns={'clnt_tenure_yr': 'tenure_year', 'clnt_tenure_mnth': 'tenure_month', 'clnt_age':'client_age', 'gendr':'gender','bal':'total_balance'})
demo

,client_id,tenure_year,tenure_month,client_age,gender,num_accts,total_balance,calls_6_mnth,logons_6_mnth
0,836976,6.0,73.0,60.5,U,2.0,45105.30,6.0,9.0
1,2304905,7.0,94.0,58.0,U,2.0,110860.30,6.0,9.0
2,1439522,5.0,64.0,32.0,U,2.0,52467.79,6.0,9.0
3,1562045,16.0,198.0,49.0,M,2.0,67454.65,3.0,6.0
4,5126305,12.0,145.0,33.0,F,2.0,103671.75,0.0,3.0
...,...,...,...,...,...,...,...,...,...
70604,7993686,4.0,56.0,38.5,U,3.0,1411062.68,5.0,5.0
70605,8981690,12.0,148.0,31.0,M,2.0,101867.07,6.0,6.0
70606,333913,16.0,198.0,61.5,F,2.0,40745.00,3.0,3.0
70607,1573142,21.0,255.0,68.0,M,3.0,475114.69,4.0,4.0
70608,5602139,21.0,254.0,59.5,F,3.0,157498.73,7.0,7.0

In [7]:
demo['gender'].unique()

# make a dict

array(['U', 'M', 'F', nan, 'X'], dtype=object)

In [15]:
demo['gender'] = demo['gender'].replace(['X', 'U', 'nan'], 'unknown')
demo['gender'] = demo['gender'].fillna('unknown')

# Display the cleaned DataFrame
print("\nDataFrame after cleaning 'gender' column:")
print(demo)

DataFrame after cleaning 'gender' column:
       client_id  tenure_year  tenure_month  client_age   gender  num_accts  \
0         836976          6.0          73.0        60.5  unknown        2.0
1        2304905          7.0          94.0        58.0  unknown        2.0
2        1439522          5.0          64.0        32.0  unknown        2.0
3        1562045         16.0         198.0        49.0        M        2.0
4        5126305         12.0         145.0        33.0        F        2.0
...          ...          ...           ...         ...      ...        ...
70604    7993686          4.0          56.0        38.5  unknown        3.0
70605    8981690         12.0         148.0        31.0        M        2.0
70606     333913         16.0         198.0        61.5        F        2.0
70607    1573142         21.0         255.0        68.0        M        3.0
70608    5602139         21.0         254.0        59.5        F        3.0

       total_balance  calls_6_mnth  logons_6_mnth
0           45105.30           6.0            9.0
1          110860.30           6.0            9.0
2           52467.79           6.0            9.0
3           67454.65           3.0            6.0
4          103671.75           0.0            3.0
...              ...           ...            ...
70604     1411062.68           5.0            5.0
70605      101867.07           6.0            6.0
70606       40745.00           3.0            3.0
70607      475114.69           4.0            4.0
70608      157498.73           7.0            7.0

[70609 rows x 9 columns]

In [17]:
gender_counts = demo['gender'].value_counts()

# Get counts for 'F' and 'M'
count_f = gender_counts.get('F', 0)
count_m = gender_counts.get('M', 0)

# Display the counts
print(f"\nCount of 'F' in 'gender' column: {count_f}")
print(f"Count of 'M' in 'gender' column: {count_m}")

Count of 'F' in 'gender' column: 22746
Count of 'M' in 'gender' column: 23724

In [19]:
gender_counts = demo['gender'].value_counts()
count_unknown = gender_counts.get('unknown', 0)

# Alternatively, count using boolean indexing
count_unknown_alternative = (demo['gender'] == 'unknown').sum()

# Display the counts
print(f"\nCount of 'unknown' in 'gender' column: {count_unknown}")

Count of 'unknown' in 'gender' column: 24139

In [21]:
demo['client_age'] = demo['client_age'].round(0).fillna(-1).astype(int)

# Display the DataFrame after rounding
print("\nDataFrame after rounding 'client_age':")
print(demo[['client_age']].head())

DataFrame after rounding 'client_age':
   client_age
0          60
1          58
2          32
3          49
4          33

In [27]:
# Fill NaN values before converting to int
cols_to_clean = ['tenure_year', 'tenure_month', 'calls_6_mnth', 'logons_6_mnth', 'num_accts', 'total_balance']
demo[cols_to_clean] = demo[cols_to_clean].round(0).fillna(-1).astype(int)

print("\nDataFrame after cleaning 'tenure_year', 'tenure_month', 'calls_6_mnth', 'logons_6_mnth', 'num_accts', 'total_balance' :")
print(demo)

DataFrame after cleaning 'tenure_year', 'tenure_month', 'calls_6_mnth', 'logons_6_mnth', 'num_accts', 'total_balance' :
       client_id  tenure_year  tenure_month  client_age   gender  num_accts  \
0         836976            6            73          60  unknown          2
1        2304905            7            94          58  unknown          2
2        1439522            5            64          32  unknown          2
3        1562045           16           198          49        M          2
4        5126305           12           145          33        F          2
...          ...          ...           ...         ...      ...        ...
70604    7993686            4            56          38  unknown          3
70605    8981690           12           148          31        M          2
70606     333913           16           198          62        F          2
70607    1573142           21           255          68        M          3
70608    5602139           21           254          60        F          3

       total_balance  calls_6_mnth  logons_6_mnth
0              45105             6              9
1             110860             6              9
2              52468             6              9
3              67455             3              6
4             103672             0              3
...              ...           ...            ...
70604        1411063             5              5
70605         101867             6              6
70606          40745             3              3
70607         475115             4              4
70608         157499             7              7

[70609 rows x 9 columns]

In [28]:
demo.nunique()

client_id        70609
tenure_year         55
tenure_month       483
client_age          83
gender               3
num_accts            9
total_balance    56924
calls_6_mnth         9
logons_6_mnth       10
dtype: int64

In [42]:
demo.head()

,client_id,tenure_year,tenure_month,client_age,gender,num_accts,total_balance,calls_6_mnth,logons_6_mnth
0,836976,6,73,60,unknown,2,45105,6,9
1,2304905,7,94,58,unknown,2,110860,6,9
2,1439522,5,64,32,unknown,2,52468,6,9
3,1562045,16,198,49,M,2,67455,3,6
4,5126305,12,145,33,F,2,103672,0,3

In [29]:
exp_clients = pd.read_csv('df_final_experiment_clients.txt')
exp_clients

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [30]:
exp_clients.columns = [col.lower() for col in exp_clients.columns]
print(exp_clients.columns)

Index(['client_id', 'variation'], dtype='object')

In [36]:
exp_clients['variation'] = exp_clients['variation'].fillna('unknown')

# Display the DataFrame after cleaning
print("\nDataFrame after replacing NaN values in 'variation':")
print(exp_clients)

DataFrame after replacing NaN values in 'variation':
       client_id variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347   unknown
70605    8788427   unknown
70606     266828   unknown
70607    1266421   unknown
70608    9895983   unknown

[70609 rows x 2 columns]

In [39]:
variation_counts = exp_clients['variation'].value_counts()

# Display the counts of unique values
print("\nCounts of unique values in 'variation' column:")
print(variation_counts)

Counts of unique values in 'variation' column:
variation
Test       26968
Control    23532
unknown    20109
Name: count, dtype: int64

In [31]:
exp_clients_duplicates = exp_clients.duplicated()
exp_clients_duplicates.sum()

0

In [32]:
print(exp_clients.isnull().sum())

client_id        0
variation    20109
dtype: int64

In [40]:
exp_clients['variation'].unique()

array(['Test', 'Control', 'unknown'], dtype=object)

In [41]:
exp_clients.nunique()

client_id    70609
variation        3
dtype: int64